app/controllers/tqrdc/groups_controller.rb

  def create
    @tqrdc_group = Tqrdc::Group.new(tqrdc_group_params)

    respond_to do |format|
      if @tqrdc_group.save
---
INSERT INTO "TQRDC_GROUP" ("NAME", "DESCRIPTION", "SCORE", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6)  [["name", "T1"], ["description", "T1"], ["score", 102.5], ["created_at", 2015-07-14 11:12:22 +0800], ["updated_at", 2015-07-14 11:12:22 +0800], ["id", 1]]