app/controllers/users_controller.rb

SELECT COUNT(*) FROM "USER" WHERE (username like '%%')
---
  def index
    @users = User.where("username like '%#{params[:username] || ''}%'")
                 .page(params[:page] || 1)

INSERT INTO "USER" ("EMAIL", "ENCRYPTED_PASSWORD", "USERNAME", "ROLE", "CREATED_AT", "UPDATED_AT", "ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "USER" SET "ENCRYPTED_PASSWORD" = :a1, "ROLE" = :a2, "UPDATED_AT" = :a3 WHERE "USER"."ID" = :a4  [["encrypted_password", "$2a$10$3pME4CLXLFJGtvDDC36Oh.G1sdAFNmptJpbMw638v6cE9DjdhDshi"], ["role", "admin"], ["updated_at", Tue, 14 Jul 2015 11:11:11 CST +08:00], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "USER" WHERE "USER"."ID" = :a1  [["id", 1]]
---
  def destroy
    @user.destroy

SELECT * FROM (SELECT  "USER".* FROM "USER" WHERE "USER"."ID" = :a1  ORDER BY "USER"."ID" ASC ) WHERE ROWNUM <= 1  [["id", 2]]
---
    def set_user
      @user = User.find(params[:id])